---
type: STLImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# STLImportOptions

`Autodesk.Revit.DB.STLImportOptions` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | STLImportOptions | — | `` |
| Constructor | STLImportOptions | 2022.1 | `public STLImportOptions ()` |